       IDENTIFICATION DIVISION.
       PROGRAM-ID. POLLEN-SERVICE.

       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       01 BUFFER                   PIC X(10000).
       01 DATA-URL                 PIC X(1000) VALUE SPACES.

       LINKAGE SECTION.
       01 LATITUDE                 PIC S9(3)V9(8).
       01 LONGITUDE                PIC S9(3)V9(8).
       01 POLLEN-OUTPUT            PIC X(10000) VALUE SPACES.

       PROCEDURE DIVISION USING
           BY REFERENCE LATITUDE
           BY REFERENCE LONGITUDE
           BY REFERENCE POLLEN-OUTPUT.

           CALL "POLLEN-DATA-SOURCE" USING
               BY REFERENCE LATITUDE
               BY REFERENCE LONGITUDE
               BY REFERENCE DATA-URL
               BY REFERENCE BUFFER

           CALL "POLLEN-PARSER" USING
               BY REFERENCE BUFFER

           CALL "POLLEN-RENDER" USING
               BY REFERENCE DATA-URL
               BY REFERENCE POLLEN-OUTPUT

           GOBACK.

       END PROGRAM POLLEN-SERVICE.
