       FD FD-POLLEN-FILE.
       01 F-DATE-MAJ                      PIC X(24) VALUE SPACES.
       01 F-RESPONSIBLE-POLLEN            PIC X(64) VALUE SPACES.
       01 F-POLLEN-RECORD.
           05 F-POLLEN-NAME               PIC X(16).
           05 F-POLLEN-CODE               PIC 9(1).
