       FD POLLEN-FILE.
       01 DATE-MAJ                    PIC X(24).
       01 RESPONSIBLE-POLLEN           PIC X(64) VALUE SPACES.
       01 POLLEN-RECORD.
           05 POLLEN-NAME               PIC X(16).
           05 POLLEN-CODE               PIC 9(1).
