           01  OUT-RESPONSE.
               05  OUT-RESPONSE-DATA          PIC X(10000).
               05  OUT-RESPONSE-LENGTH-BYTES  PIC 9(5) COMP-5.
